### Group By - Use Case 2

In [ ]:
# Import pandas
import pandas as pd

# Read the input file into a Dataframe
purchases = pd.read_csv("Xtra-Mart.csv")

# Display the first five rows of the Dataframe
purchases.head()

   CustID       City  Store Number  Sales (INR)  Customer Age Gender
0    1001     Mumbai            10          123            38      M
1    1003  Bangalore            23          543            40      M
2    1006      Delhi            15          220            30      F
3    1007    Chennai            17          190            45      F
4    1009     Mumbai            11          269            28      F

In [ ]:
print(purchases.groupby(['City', 'Store Number'])['Sales (INR)'].mean())

City       Store Number
Bangalore  21              140.0
           23              543.0
Chennai    17              216.0
Delhi      15              220.0
           16              190.0
           18              120.0
Mumbai     10              198.0
           11              214.5
           13              175.0
Name: Sales (INR), dtype: float64

In [ ]:
print(purchases.groupby('City').get_group("Bangalore"))

   CustID       City  Store Number  Sales (INR)  Customer Age Gender
1    1003  Bangalore            23          543            40      M
5    1010  Bangalore            21          130            56      M
9    1014  Bangalore            21          150            29      F

#### Conclusion: Using groupby we combine various forms of data